Revit 2027 API
MEPSystem.Add Method
 Add elements into the system and connect them with the system using given connectors.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Add(
	ConnectorSet connectors
)
Public Overridable Sub Add (
	connectors As ConnectorSet
)
public:
virtual void Add(
	ConnectorSet^ connectors
)
abstract Add :
        connectors : ConnectorSet -> unit
override Add :
        connectors : ConnectorSet -> unit
Parameters
connectors ConnectorSet
Connectors which are used to connect with the system.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument connectors is null, or any connector in that collection is null.
ArgumentException |  Throw when any of the input connectors have been already used, or when they don't share the same domain or system type as the system.
InvalidOperationException |  Thrown when the operation failed.
ForbiddenForDynamicUpdateException |  Thrown if this method is called during dynamic update.
Remarks
 Note: this method may not be called during dynamic update.
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace